[F_ShieldBearer X2SoldierClassTemplate]
+DisplayName="Protector"
+ClassSummary="The primary objective of the Protector is to keep the squad safe, whether it be by drawing fire, guarding them with the Ballistic Shield, or providing them with a myriad of combat effectiveness improvements."
+LeftAbilityTreeTitle="Indomitable"
+RightAbilityTreeTitle="Paladin"
+AbilityTreeTitles[0]="Indomitable"
+AbilityTreeTitles[1]="Gunman"
+AbilityTreeTitles[2]="Paladin"
+RandomNickNames[0]="Guard"
+RandomNickNames[1]="Post"
+RandomNickNames[2]="Overseer"
+RandomNickNames[3]="Paladin"
+RandomNickNames[4]="Gunman"
+RandomNickNames[5]="Tank"
+RandomNickNames[6]="Coven"
+RandomNickNames[7]="Caretaker"
+RandomNickNames[8]="Warrior"
+RandomNickNames[9]="Full Metal"
+RandomNickNames_Male[0]="Watchman"
+RandomNickNames_Male[1]="Don"
+RandomNickNames_Female[0]="Mother"

[F_ShieldBearerPassive X2AbilityTemplate]
LocFriendlyName="Ballistic Shield Training"
LocFlyOverText="Ballistic Shield Training"
LocLongDescription="This soldier has received the necessary training to use a Ballistic Shield. With combat experience, they can further hone their abilities."
LocHelpText="This soldier has received the necessary training to use a Ballistic Shield. With combat experience, they can further hone their abilities."
LocPromotionPopupText="<Bullet/> This soldier has received the necessary training to use a Ballistic Shield. With combat experience, they can further hone their abilities.<br/>"

; Adding AbilityDescName to primary pistol templates so that they display in ability descriptions properly

[Pistol_CV_Primary X2WeaponTemplate]
AbilityDescName="pistol"

[Pistol_LS_Primary X2WeaponTemplate]
AbilityDescName="pistol"

[Pistol_MG_Primary X2WeaponTemplate]
AbilityDescName="pistol"

[Pistol_CG_Primary X2WeaponTemplate]
AbilityDescName="pistol"

[Pistol_BM_Primary X2WeaponTemplate]
AbilityDescName="pistol"

; Changing descriptions of Quickdraw to be hardcoded to pistol
; By default it keys off of the secondary weapon name, which is bad for this class, but we can't change it to the assigned weapon name because the default Sharpshooter class does not have this ability assigned to their secondary weapon
[Quickdraw X2AbilityTemplate]
LocFriendlyName="Quickdraw"
LocLongDescription="Firing your pistol with your first action no longer ends your turn."
LocHelpText="Firing your pistol with your first action no longer ends your turn."
LocPromotionPopupText="<Bullet/> Quickdraw is a fundamental pistol ability, as it allows the <Ability:ClassName/> to spread their fire around to different targets in the same turn.<br/>"

; Changing descriptions of Lightning Hands to key off of the assigned weapon name instead of the secondary weapon name
[LightningHands X2AbilityTemplate]
LocFriendlyName="Lightning Hands"
LocLongDescription="Fire your <Ability:WeaponName/> at a target. This attack does not cost an action."
LocHelpText="Fire your <Ability:WeaponName/> at a target. This attack does not cost an action."
LocFlyOverText="Lightning Hands"